Revit 2026 API

# PointCloudOverrideSettingsAssign Method

---

Assigns values of the source settings to this object.

**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Assign(
	PointCloudOverrideSettings other
)
```
```vb
Public Sub Assign (
	other As PointCloudOverrideSettings
)
```
```cpp
public:
void Assign(
	PointCloudOverrideSettings^ other
)
```
```fsharp
member Assign :
        other : PointCloudOverrideSettings -> unit
```

#### Parameters

other PointCloudOverrideSettings
     The source settings.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

PointCloudOverrideSettings Class

Autodesk.Revit.DB.PointClouds Namespace